Data Cleaning

In [3]:
import pandas as pd

In [11]:
data = {
    'A': [1,2,2,4,15,96],
    'B': [2,2,2,23,66,47]
}

df = pd.DataFrame(data)
df

    A   B
0   1   2
1   2   2
2   2   2
3   4  23
4  15  66
5  96  47

In [12]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [13]:
df1 = df.drop_duplicates()
df1

    A   B
0   1   2
1   2   2
3   4  23
4  15  66
5  96  47

In [14]:
q = df['A'].quantile(0.99)
q

91.95000000000002

In [15]:
df['A'] = df['A'].clip(lower=None, upper=q)
df

       A   B
0   1.00   2
1   2.00   2
2   2.00   2
3   4.00  23
4  15.00  66
5  91.95  47

Handling of missing values

In [16]:
import numpy as np

data = {'A': [1,2,3,np.nan,np.nan], 'B':[5,np.nan,6,7,np.nan]}
df = pd.DataFrame(data)
df

     A    B
0  1.0  5.0
1  2.0  NaN
2  3.0  6.0
3  NaN  7.0
4  NaN  NaN

In [21]:
df.isna()

       A      B
0  False  False
1  False   True
2  False  False
3   True  False
4   True   True

In [22]:
df.isna().sum()

A    2
B    2
dtype: int64

In [23]:
df.fillna(value=0)

     A    B
0  1.0  5.0
1  2.0  0.0
2  3.0  6.0
3  0.0  7.0
4  0.0  0.0

In [24]:
df['A'] = df['A'].fillna(df['A'].mean())
df['B'] = df['B'].fillna(df['B'].mean())
df

     A    B
0  1.0  5.0
1  2.0  6.0
2  3.0  6.0
3  2.0  7.0
4  2.0  6.0

Data Normalization and scaling :
- To transfor the numerical data to a common scale. To avoid bias towards the higher values

In [26]:
max_value = df.max()
min_value = df.min()
print(max_value)
print(min_value)

A    3.0
B    7.0
dtype: float64
A    1.0
B    5.0
dtype: float64

Encoding of categorical data

In [62]:
data = {
    'A': ['Red', 'Blue', 'White', 'White', 'Yellow', 'Orange'],
    'B': [2,2,2,23,66,47]
}

df = pd.DataFrame(data)
df

        A   B
0     Red   2
1    Blue   2
2   White   2
3   White  23
4  Yellow  66
5  Orange  47

In [63]:
dummies = pd.get_dummies(df['A']).astype(int)
df = df.drop('A', axis=1)
df = df.join(dummies)
df

    B  Blue  Orange  Red  White  Yellow
0   2     0       0    1      0       0
1   2     1       0    0      0       0
2   2     0       0    0      1       0
3  23     0       0    0      1       0
4  66     0       0    0      0       1
5  47     0       1    0      0       0